forge/Misc/mongodb_the_definitive_guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>《MongoDB权威指南》读书笔记</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-02-13 14:56:06 CST"/>
<meta name="author" content="crackcell"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">MongoDB权威指南</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 基本概念 </a></li>
<li><a href="#sec-2">2 基本数据类型 </a></li>
<li><a href="#sec-3">3 基本CRUD操作 </a></li>
<li><a href="#sec-4">4 原子修改器 </a></li>
<li><a href="#sec-5">5 索引 </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本概念 </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>
文档：key-value的集合
</li>
<li>
集合：文档的集合
</li>
<li>
数据库：集合的集合
<ul>
<li>
admin：root数据库
</li>
<li>
local：本地数据库，可以用来存放任意的本地集合，数据不会被复制
</li>
<li>
config：配置数据库
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 基本数据类型 </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
null
</li>
<li>
boolean
</li>
<li>
32位int（shell没有，会被转换成64位float）
</li>
<li>
64位int（shell没有，会被转换成64位float）
</li>
<li>
64位float
</li>
<li>
字符串
</li>
<li>
对象id
</li>
<li>
日期
</li>
<li>
javascrupt代码
</li>
<li>
二进制数据
</li>
<li>
最大值（shell里面没有）
</li>
<li>
最小值（shell里面没有）
</li>
<li>
未定义：undefined
</li>
<li>
数组
</li>
<li>
嵌套文档
</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 基本CRUD操作 </h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>
插入
<ul>
<li>
数据库.集合[.子集合].insert()
</li>
<li>
数据库.集合[.子集合].save()，shell函数，不存在就增加，存在就更新
</li>
</ul>
</li>
<li>
检索
<ul>
<li>
检索出一个：数据库.集合[.子集合].findOne()
</li>
<li>
检索多个：数据库.集合[.子集合].find()
</li>
</ul>
</li>
<li>
更新：数据库.集合[.子集合].update()
</li>
<li>
删除：数据库.集合[.子集合].remove()
</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 原子修改器 </h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>
$set：设置一个字段
</li>
<li>
$unset：删除一个字段
</li>
<li>
$push：向一个数组追加一个元素
</li>
<li>
$pushAll：向一个数组最佳多个元素
</li>
<li>
$pull：从数组中删除一个元素
</li>
<li>
$pushAll：从数组中删除多个元素
</li>
<li>
$inc：自增
</li>
<li>
$bit：位操作
</li>
<li>
$upsert：更新文档，文档不存在就创建
</li>
</ul>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 索引 </h2>
<div class="outline-text-2" id="text-5">

<ul>
<li>
创建索引：数据库.集合[.子集].ensureIndex()
</li>
<li>
获取查询中索引使用信息：数据库.集合[.子集].explain()
</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author"> Author: crackcell
<a href="mailto:tanmenglong AT gmail DOT com">&lt;tanmenglong AT gmail DOT com&gt;</a>
</p>
<p class="date"> Date: 2012-03-19 14:56:06 CST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
